app/views/admins/show.html.slim

						tbody
							- @store.sites.each do |site|
---
SELECT "sites".* FROM "sites" WHERE "sites"."store_id" = ?  [["store_id", 1]]

									td = site.name
									td = site.chat_rooms.count
---
SELECT COUNT(*) FROM "chat_rooms" WHERE "chat_rooms"."site_id" = ?  [["site_id", 3]]