app/views/admins/show.html.slim

SELECT "sites".* FROM "sites" WHERE "sites"."store_id" = ?  [["store_id", 1]]
---
						tbody
							- @store.sites.each do |site|

SELECT COUNT(*) FROM "chat_rooms" WHERE "chat_rooms"."site_id" = ?  [["site_id", 1]]
---
									td = site.name
									td = site.chat_rooms.count