app/views/stores/_item.html.slim

SELECT "sites"."name", "sites"."id" FROM "sites" WHERE "sites"."store_id" = ?  [["store_id", 1]]
---
				= f.label :site_id, 'サイト名'
				= f.select :site_id, options_for_select(@store.sites.pluck(:name, :id), f.object.site_id), {}, {}
		.field.remove-btn