app/views/stores/_messages.html.slim

			ul.timeline
				- @chatRoom.messages.each do |msg|
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = ?  [["chat_room_id", 8]]