app/views/stores/_send_box.html.slim

SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = ?  [["chat_room_id", 8]]
---
			ul.timeline
				- @chatRoom.messages.each do |msg|