app/views/stores/htmltag.html.slim

SELECT  "htmls".* FROM "htmls" ORDER BY "htmls"."id" ASC LIMIT ?  [["LIMIT", 1]]
---

- lines = Html.first.data.split('*****')