app/views/stores/message.html.slim

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
						.panel-body
							- site = Site.find(@chatRoom.site_id)

SELECT "items".* FROM "items" WHERE "items"."site_id" = ?  [["site_id", 1]]
---
								fieldset
									- site.items.all.each do |item|
										.form-group(style="padding: 0 15px;")