app/views/stores/message.html.slim


- site = Site.find(@chatRoom.site_id)
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	.items
		- site.items.all.each do |item|
			.field
---
SELECT "items".* FROM "items" WHERE "items"."site_id" = ?  [["site_id", 1]]