app/views/stores/show.html.slim

SELECT "sites"."name", "sites"."id" FROM "sites" WHERE "sites"."store_id" = ?  [["store_id", 1]]
---
								label.control-label(style="margin-right: 10px;" ) ユーザーリスト
								= f.select :site_id, options_for_select(@store.sites.pluck(:name, :id), @site.nil? ? '全体' : [@site.name, @site.id]), {include_blank: '全体'}, {onchange: "$('#site_filter').submit();", class: "form-control"}