app/views/stores/show.html.slim

								label.control-label(style="margin-right: 10px;" ) ユーザーリスト
								= f.select :site_id, options_for_select(@store.sites.pluck(:name, :id), @site.nil? ? '全体' : [@site.name, @site.id]), {include_blank: '全体'}, {onchange: "$('#site_filter').submit();", class: "form-control"}
---
SELECT "sites"."name", "sites"."id" FROM "sites" WHERE "sites"."store_id" = ?  [["store_id", 1]]

										- next if @site.id != room.site.id
									- user = User.find(room.user_id)
									- next unless @store.site_ids.include?(user.site_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "sites"."id" FROM "sites" WHERE "sites"."store_id" = ?  [["store_id", 1]]

									td = room.visit_count
									td = History.where(user_id: user.id, site_id: room.site_id).count
---
SELECT COUNT(*) FROM "histories" WHERE "histories"."user_id" = ? AND "histories"."site_id" = ?  [["user_id", 8], ["site_id", 1]]