app/helpers/stores_helper.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def current_store
		session[:store_id].nil? ? nil : Store.find_by(id: session[:store_id].to_i)

SELECT  "stuffs".* FROM "stuffs" WHERE "stuffs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def current_stuff
		session[:stuff_id].nil? ? nil : Stuff.find_by(id: session[:stuff_id].to_i)