app/controllers/admins_controller.rb

	def index
		@stores = Store.all
---
SELECT "stores".* FROM "stores"

	def create
		store = Store.create(store_params)
---
INSERT INTO "stores" ("auth_id", "auth_password", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["auth_id", "23456789"], ["auth_password", "password"], ["name", "TEST2"], ["created_at", "2019-10-15 07:33:08.261476"], ["updated_at", "2019-10-15 07:33:08.261476"]]

	def edit
		@store.sites.build if @store.sites.count.zero?
---
SELECT "sites".* FROM "sites" WHERE "sites"."store_id" = ?  [["store_id", 1]]
SELECT COUNT(*) FROM "sites" WHERE "sites"."store_id" = ?  [["store_id", 1]]

	def destroy
		Store.find(params[:id].to_i).destroy!
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

	def delete_site
		Site.find(params[:site_id].to_i).destroy!
---
DELETE FROM "sites" WHERE "sites"."id" = ?  [["id", 2]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def site
		@site = Site.find(params[:site_id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def chatroom
		@chatRoom = ChatRoom.find(params[:chat_room_id].to_i)
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def set_store
		@store = Store.find(params[:id].to_i)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]