app/controllers/stores_controller.rb

	def show
		if params[:param].present?
			@site = Site.find(params[:param][:site_id]) if params[:param][:site_id].present?
		end
		@sites = @store.sites
		@chatRooms = ChatRoom.where(site_id: @sites.ids)
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."site_id" IN (?, ?)  [["site_id", 1], ["site_id", 2]]

	def edit
		@store.items.build if @store.items.count.zero?
---
SELECT "items".* FROM "items" WHERE "items"."store_id" = ? AND "items"."id" IN (?, ?, ?)  [["store_id", 1], ["id", 1], ["id", 10], ["id", 11]]
SELECT COUNT(*) FROM "items" WHERE "items"."store_id" = ?  [["store_id", 1]]

	def stuff
		@store.stuffs.build if @store.stuffs.count.zero?
---
SELECT "stuffs".* FROM "stuffs" WHERE "stuffs"."store_id" = ?  [["store_id", 1]]
SELECT COUNT(*) FROM "stuffs" WHERE "stuffs"."store_id" = ?  [["store_id", 1]]

	def message
		gon.chatEnabled = true
		gon.defaultEnable = true
		@chatRoom = ChatRoom.find(params[:chat_room_id])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

	def send_msg
		message = Message.create(message_params)
---
INSERT INTO "messages" ("chat_room_id", "message", "toUser", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["chat_room_id", 8], ["message", "Konnichiha"], ["toUser", 1], ["created_at", "2019-10-18 14:23:42.985995"], ["updated_at", "2019-10-18 14:23:42.985995"]]

	def set_item
		@store.items.update(selected: false)
		Item.find(params[:items][:item_id]).update(selected: true)
---
UPDATE "items" SET "selected" = ? WHERE "items"."id" = ?  [["selected", 0], ["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "selected" = ? WHERE "items"."id" = ?  [["selected", 1], ["id", 1]]

	def set_store
		@store = Store.find_by(id: params[:id].to_i)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]