app/models/chat_room.rb

SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_room_id" = ? AND "messages"."isPayURL" = ?  [["chat_room_id", 3], ["isPayURL", 1]]
---
	def get_pays
		return self.messages.where(isPayURL: true).count