app/models/store.rb

	def self.check_auth(params)
		Store.where(auth_id: params[:auth_id], auth_password: params[:auth_password]).first
---
SELECT  "stores".* FROM "stores" WHERE "stores"."auth_id" = ? AND "stores"."auth_password" = ? ORDER BY "stores"."id" ASC LIMIT ?  [["auth_id", "12345678"], ["auth_password", "password"], ["LIMIT", 1]]