app/models/stuff.rb

SELECT  "stuffs".* FROM "stuffs" WHERE "stuffs"."uid" = ? AND "stuffs"."password" = ? ORDER BY "stuffs"."id" ASC LIMIT ?  [["uid", "12345678"], ["password", ""], ["LIMIT", 1]]
---
	def self.check_auth(params)
		where(uid: params[:auth_id], password: params[:auth_password]).first